Repository: smart-fire-system/flutter-app
Catalog: lib/l10n/intl_*.arb
Languages: ar

# app_name
source: Fire Alarm System
ar: نظام إنذار الحريق

# account_not_verified_title
source: Account Not Verified
ar: الحساب غير مُفعّل

# account_not_verified_message
source: Your account is not verified. Please check your email for the verification link.
ar: حسابك غير مُفعّل. يرجى التحقق من بريدك الإلكتروني للحصول على رابط التفعيل.

source: Resend Verification Email
ar: إعادة إرسال البريد الإلكتروني للتفعيل

# access_denied_title
source: Access Denied
ar: تم رفض الوصول

# access_denied_message
source: You do not have access to this section. Please wait until the system administrators grant you access.
ar: ليس لديك صلاحية الوصول إلى هذا القسم. يرجى الانتظار حتى يتم منحك الصلاحيات من مسؤولي النظام.

source: Error
ar: خطأ

source: Ok
ar: حسناً

source: Cancel
ar: إلغاء

source: and
ar: و

# forgot_password
source: Forgot your password?
ar: هل نسيت كلمة المرور؟

# enter_email_to_reset
source: Please enter your email address to reset your password.
ar: يرجى إدخال بريدك الإلكتروني لإعادة تعيين كلمة المرور.

# reset_email_sent
source: A password reset email has been sent. Please check your inbox.
ar: تم إرسال بريد إلكتروني لإعادة تعيين كلمة المرور. يرجى التحقق من صندوق البريد.

# confirmEmailSent
source: A confirmation email has been sent. Please check your inbox.
ar: تم إرسال بريد إلكتروني لتفعيل حسابك. يرجى التحقق من صندوق البريد.

# searchBy
source: Search by name, email or phone number ...
ar: بحث بالاسم، البريد الالكتروني أو رقم الهاتف ...

# searchByNameCode
source: Search by name or code ...
ar: بحث بالإسم أو الكود ...

source: Home
ar: الصفحة الرئيسية

source: Profile
ar: الملف الشخصي

# profile_subtitle
source: View and manage profile
ar: عرض وتعديل الملف الشخصي

source: Notifications
ar: الإشعارات

source: Change Language
ar: تغيير اللغة

source: System
ar: النظام

source: Settings
ar: الإعدادات

# myProfile
source: Profile
ar: صفحتي

source: View and Control System
ar: عرض والتحكم في النظام

source: Manage and Configure System
ar: إدارة وتعديل النظام

source: Complaints
ar: الشكاوى

# complaints_subtitle
source: View and manage complaints
ar: عرض وإدارة الشكاوى

source: View Complaints
ar: عرض الشكاوى

source: Submit Complaint
ar: تقديم شكوى

source: Reports
ar: التقارير

source: Visits
ar: الزيارات

source: Branches
ar: الفروع

source: Companies
ar: الشركات

source: Maintenance Contracts
ar: عقود الصيانة

source: System Status and Faults
ar: حالة النظام والأعطال

# selectUsers
source: Seleect Users
ar: اختيار المستخدمين

source: All Users
ar: جميع المستخدمين

source: No users selected
ar: لا يوجد مستخدمين تم تحديدهم

source: Users
ar: المستخدمون

source: User
ar: المستخدم

source: Master Admins
ar: المسئولون الرئيسيون

source: Admins
ar: المسؤولون

source: Company Managers
ar: مديرو الشركات

source: Branch Managers
ar: مديرو الفروع

source: Employees
ar: الموظفون

source: Clients
ar: العملاء

source: No Role Users
ar: مستخدمون بدون صلاحية وصول

source: Master Admin
ar: مسئول رئيسي

source: Admin
ar: مسئول

source: Company Manager
ar: مدير شركة

source: Branch Manager
ar: مدير فرع

source: Employee
ar: موظف

source: Client
ar: عميل

source: Role
ar: صلاحية الوصول

# chooseRole
source: Choose access role
ar: اختيار صلاحية الوصول

source: No Role
ar: بدون صلاحية وصول

source: Logout
ar: تسجيل الخروج

# system_monitoring_control
source: System Monitoring and Control
ar: مراقبة النظام والتحكم

# system_monitoring_card_subtitle
source: View and manage system
ar: عرض والتحكم بالنظام

# system_monitoring_description
source: Monitor the current state of each sensor and control sub-units. You can also perform actions like turning devices on or off directly from this interface.
ar: مراقبة الحالة الحالية لكل حساس والتحكم في الوحدات الفرعية. يمكنك أيضًا تنفيذ إجراءات مثل تشغيل أو إيقاف الأجهزة مباشرةً من هذه الواجهة.

# reportsDescription
source: Show reports for maintenance contracts, visits and system status.
ar: عرض تقارير لعقود الصيانة، الزيارات وحالة النظام.

# complaintsDescription
source: Show open compaints or submit new one.
ar: عرض الشكاوى المفتوحة أو تقديم شكوى جديدة.

# usersDescription
source: Show and give or remove access from users
ar: عرض وإعطاء أو حذف صلاحيات للمستخدمين

# branchesDescription
source: Add or remove branches
ar: إضافة أو حذف الفروع

# users_and_branches
source: Users & Branches
ar: المستخدمون والفروع

# users_and_branches_subtitle
source: View and manage users & branches
ar: عرض وإدارة المستخدمين والفروع

# users_branches_hierarchy_title
source: Users and Branches Hierarchy
ar: هيكل المستخدمين والفروع

# users_branches_hierarchy_subtitle
source: View and manage users and branches hierarchy
ar: عرض وإدارة هيكل المستخدمين والفروع

# branches_subtitle
source: View and manage branches
ar: عرض وإدارة الفروع

# companies_subtitle
source: View and manage companies
ar: عرض وإدارة الشركات

# users_subtitle
source: View and manage users
ar: عرض وإدارة المستخدمين

# deleteUser
source: Remove User
ar: حذف المستخدم

# changeAccessRole
source: Modify Access Role
ar: تغيير صلاحيات الوصول

# confirmDeleteUser
source: Are you sure you want to permanently delete this user from the system?
ar: هل أنت متأكد من أنك تريد حذف هذا المستخدم نهائيًا من النظام؟

# confirmChangeAccessRole
source: Do you want to proceed with changing the user's access permissions?
ar: هل تريد المتابعة لتغيير صلاحيات وصول المستخدم؟

# userDeletedSuccessMessage
source: User has been successfully deleted from the system.
ar: تم حذف المستخدم بنجاح من النظام.

# accessRoleChangedSuccessMessage
source: User's access role has been successfully updated.
ar: تم تحديث صلاحيات وصول المستخدم بنجاح.

source: Companies and Branches
ar: الشركات والفروع

# companiesAndBranchesDescription
source: Manage companies and their branches. Add or remove companies and branches, and view detailed information about them.
ar: إدارة الشركات والفروع. أضف أو احذف الشركات والفروع، واطلع على تفاصيلها.

source: Add
ar: إضافة

source: Add New Master Admin
ar: إضافة مسئول رئيسي جديد

source: Add New Admin
ar: إضافة مسئول جديد

source: Add New Company Manager
ar: إضافة مدير شركة جديد

source: Add New Branch Manager
ar: إضافة مدير فرع جديد

source: Add New Employee
ar: إضافة موظف جديد

source: Add New Client
ar: إضافة عميل جديد

source: No users to view.
ar: لا يوجد مستخدمون للعرض.

# noCompaneiesToAddCompanyManager
source: There are no companies to add company managers to. Please add a company first.
ar: لا توجد شركات لإضافة مديري شركات إليها. يرجى إضافة شركة أولاً.

# noBranchesToAddBranchManager
source: There are no branches to add branch managers to. Please add a branch first.
ar: لا توجد فروع لإضافة مديري فروع إليها. يرجى إضافة فرع أولاً.

# noBranchesToAddEmployee
source: There are no branches to add employees to. Please add a branch first.
ar: لا توجد فروع لإضافة موظفين إليها. يرجى إضافة فرع أولاً.

# noBranchesToAddClient
source: There are no branches to add clients to. Please add a branch first.
ar: لا توجد فروع لإضافة عملاء إليها. يرجى إضافة فرع أولاً.

source: Welcome
ar: مرحبا

# welcome_message
source: Welcome to the Fire Alarm System. Please login or sign up.
ar: مرحبًا في نظام إنذار الحريق. يرجى تسجيل الدخول أو إنشاء حساب.

source: Login
ar: تسجيل الدخول

source: Sign Up
ar: إنشاء حساب جديد

source: Name
ar: الاسم

# email
source: Email Address
ar: عنوان البريد الإلكتروني

# phone
source: Phone Number
ar: رقم الهاتف

source: Password
ar: كلمة المرور

# confirm_password
source: Please confirm your password
ar: يرجى تأكيد كلمة المرور

# don_t_have_an_account
source: Don't have an account? Sign Up
ar: ليس لديك حساب؟ إنشاء حساب

# already_have_an_account
source: Already have an account? Log In
ar: لديك حساب بالفعل؟ تسجيل الدخول

# select_language
source: Please choose a language
ar: يرجى اختيار اللغة

source: Log in with Google
ar: تسجيل الدخول باستخدام جوجل

source: Log in with Facebook
ar: تسجيل الدخول باستخدام فيسبوك

source: Sign up with Google
ar: إنشاء حساب باستخدام جوجل

source: Sign up with Facebook
ar: إنشاء حساب باستخدام فيسبوك

source: Continue with Google
ar: المتابعة باستخدام جوجل

source: or
ar: أو

# enter_name
source: Please enter your name
ar: يرجى إدخال اسمك

# enter_phone_number
source: Please enter your phone number
ar: يرجى إدخال رقم هاتفك

# valid_phone_number
source: Please enter a valid phone number
ar: يرجى إدخال رقم هاتف صالح

# enter_password
source: Please enter your password
ar: يرجى إدخال كلمة المرور

# password_length
source: Password must be at least 6 characters long
ar: يجب أن تتكون كلمة المرور من 6 أحرف على الأقل

# password_mismatch
source: Passwords do not match
ar: كلمات المرور غير متطابقة

# enter_email
source: Please enter your email address
ar: يرجى إدخال عنوان بريدك الإلكتروني

# valid_email
source: Please enter a valid email address
ar: يرجى إدخال عنوان بريد إلكتروني صالح

# signup_in_progress
source: Please wait while creating your account
ar: يرجى الانتظار أثناء إنشاء الحساب

# wait_while_loading
source: Pleae wait while loading data ...
ar: يرجى الانتظار أثناء تحميل البيانات ...

# login_welcome
source: Welcome back! Please log in to your account to continue.
ar: مرحبًا بعودتك! يرجى تسجيل الدخول إلى حسابك للمتابعة.

# signup_welcome
source: Welcome! Create a new account to join us and enjoy our services.
ar: مرحبًا! أنشئ حسابًا جديدًا للانضمام إلينا والاستمتاع بالخدمات.

source: Change Password
ar: تغيير كلمة المرور

# edit_information
source: Edit Inforamation
ar: تعديل البيانات

source: Save Changes
ar: حفظ التعديلات

# info_updated
source: Profile info updated successfully
ar: تم تعديل البيانات بنجاح

# selectCompanies
source: Select companies to view
ar: يرجى اختيار الشركات للعرض

source: All companies
ar: كل الشركات

source: No companies selected
ar: لم يتم اختيار أي شركات

source: No branches to view
ar: لا يوجد فروع لعرضها

source: No companies to view
ar: لا يوجد شركات لعرضها

# noCompaniesToAddBranch
source: There are no companies to add branches to. Please add a company first
ar: لا يوجد شركات لإضافة فروع لها، برجاء إضافة شركة أولاً.

source: Branch Information
ar: بيانات الفرع

source: Company Information
ar: بيانات الشركة

source: Contact Information
ar: بيانات التواصل

source: Address
ar: العنوان

source: Code
ar: الكود

source: Created At
ar: تاريخ الإضافة

source: Comment
ar: التعليقات

source: Branch Name
ar: إسم الفرع

source: Edit Branch
ar: تعديل الفرع

source: Company
ar: الشركة

source: Branch
ar: الفرع

source: Change Company
ar: تغيير الشركة

source: Delete Branch
ar: حذف الفرع

# branchModifyWarning
source: Please double-check the updated branch details before saving. Are you sure you want to proceed?
ar: يرجى التحقق من صحة تفاصيل الفرع المحدثة قبل الحفظ. هل أنت متأكد أنك تريد المتابعة؟

# branchDeleteWarning
source: Deleting this branch is irreversible. Are you sure you want to proceed?
ar: حذف هذا الفرع لا يمكن التراجع عنه. هل أنت متأكد أنك تريد المتابعة؟

source: Yes, delete branch
ar: نعم، حذف الفرع

source: Yes, save changes
ar: نعم، حفظ التغييرات

source: No, cancel
ar: لا، إلغاء

# waitDeltingBranch
source: Please wait while deleting branch
ar: برجاء الانتظار، جاري حذف الفرع

# waitSavingBranch
source: Please wait while saving branch information
ar: برجاء الانتظار، جاري حفظ بيانات الفرع

# enterBranchName
source: Please enter the branch name
ar: برجاء إدخال اسم الفرع

# enterBranchAddress
source: Please enter the branch address
ar: برجاء إدخال عنوان الفرع

# enterBranchPhone
source: Please enter the branch phone number
ar: برجاء إدخال رقم الهاتف للفرع

# enterBranchEmail
source: Please enter the branch email address
ar: برجاء إدخال البريد الالكتروني للفرع

# enterBranchCompany
source: Please choose a company for this branch
ar: برجاء إختيار شركة للفرع

# addCompany
source: Add New Company
ar: إضافة شركة جديدة

# companyModified
source: The company details have been updated successfully.
ar: تم تعديل بيانات الشركة بنجاح.

# companyAdded
source: The company has been added successfully.
ar: تم إضافة الشركة بنجاح.

# companyDeleted
source: The company has been deleted successfully.
ar: تم حذف الشركة بنجاح.

source: Company Name
ar: اسم الشركة

source: Edit Company
ar: تعديل الشركة

source: Delete Company
ar: حذف الشركة

# companyModifyWarning
source: Please double-check the updated company details before saving. Are you sure you want to proceed?
ar: يرجى التحقق من صحة تفاصيل الشركة المحدثة قبل الحفظ. هل أنت متأكد أنك تريد المتابعة؟

# companyDeleteWarning
source: Deleting this company is irreversible. Are you sure you want to proceed?
ar: حذف هذه الشركة لا يمكن التراجع عنه. هل أنت متأكد أنك تريد المتابعة؟

source: Yes, delete company
ar: نعم، حذف الشركة

# waitDeltingCompany
source: Please wait while deleting company
ar: برجاء الانتظار، جاري حذف الشركة

# waitSavingCompany
source: Please wait while saving company information
ar: برجاء الانتظار، جاري حفظ بيانات الشركة

# enterCompanyName
source: Please enter the company name
ar: برجاء إدخال اسم الشركة

# enterCompanyAddress
source: Please enter the company address
ar: برجاء إدخال عنوان الشركة

# enterCompanyPhone
source: Please enter the company phone number
ar: برجاء إدخال رقم هاتف للشركة

# enterCompanyEmail
source: Please enter the company email address
ar: برجاء إدخال البريد الالكتروني للشركة

# enterCompanyLogo
source: Please add a logo for the company
ar: برحاء إضافة شعار للشركة

# tabToAddLogo
source: Tab to add company logo
ar: إضغط لاضافة شعار للشركة

source: Logo
ar: الشعار

source: Company Logo
ar: شعار الشركة

# errorPickingImage
source: An error occured while choosing the image
ar: حدث خطأ ما أثناء اختيار الصورة

# stepsToComplete
source: To continue using the application, please complete the following steps:
ar: لمتابعة استخدام التطبيق، يرجى إكمال الخطوات التالية:

# emailVerificationTitle
source: Email Verification
ar: التحقق من البريد الإلكتروني

# emailVerified
source: Your email has been successfully verified.
ar: تم التحقق من بريدك الإلكتروني بنجاح.

# emailNotVerified
source: Your email is not verified. Click here to resend the verification email.
ar: لم يتم التحقق من بريدك الإلكتروني. اضغط هنا لإعادة إرسال بريد التفعيل.

# phoneNumberTitle
source: Add Phone Number
ar: إضافة رقم هاتف

# phoneNumberAdded
source: Your phone number has been added.
ar: تم إضافة رقم هاتفك.

# phoneNumberNotAdded
source: You have not added a phone number. Click here to add your phone number.
ar: لم تقم بإضافة رقم هاتف. اضغط هنا لإضافة رقم هاتفك.

# accessRoleTitle
source: Access Role
ar: صلاحية الوصول

# roleAssigned
source: You have been assigned an access role.
ar: تم تعيين صلاحية وصول لك.

# roleNotAssigned
source: You don't have an access role yet. Please wait for an administrator to grant you access.
ar: لم يتم تعيين صلاحية وصول لك بعد. يرجى انتظار موافقة المديرين لمنحك صلاحية وصول.

# not_authenticated
source: You are not logged in. To access this feature, please log in with your account.
ar: أنت غير مسجل الدخول. للوصول إلى هذه الميزة، يرجى تسجيل الدخول باستخدام حسابك.

# tapToSelectUser
source: Tap to select a user
ar: اضغط لاختيار مستخدم

source: Admin Permissions
ar: صلاحيات المسؤول

source: Can update admins
ar: يمكنه تعديل المسؤولين

source: Can update company managers
ar: يمكنه تعديل مديري الشركات

source: Can update branch managers
ar: يمكنه تعديل مديري الفروع

source: Can update employees
ar: يمكنه تعديل الموظفين

source: Can update clients
ar: يمكنه تعديل العملاء

source: Can add companies
ar: يمكنه إضافة شركات

source: Can edit companies
ar: يمكنه تعديل الشركات

source: Can delete companies
ar: يمكنه حذف الشركات

source: Can add branches
ar: يمكنه إضافة فروع

source: Can edit branches
ar: يمكنه تعديل الفروع

source: Can delete branches
ar: يمكنه حذف الفروع

# invalid_custom_token
source: The custom authentication token you provided is invalid. Please check and try again.
ar: رمز المصادقة المخصص غير صالح. يرجى التحقق والمحاولة مجددًا.

# custom_token_mismatch
source: The custom token provided does not match the expected format. Ensure it is correct.
ar: الرمز المخصص غير متطابق. تأكد من صحته.

# invalid_email
source: The email address entered is not valid. Please provide a valid email address.
ar: البريد الإلكتروني المدخل غير صالح. يرجى إدخال بريد إلكتروني صحيح.

# invalid_credential
source: The credentials you provided are not recognized. Please check your login details.
ar: بيانات الاعتماد غير صحيحة. يرجى التحقق من التفاصيل.

# user_disabled
source: This account has been disabled by the administrator. Contact support for assistance.
ar: تم تعطيل هذا الحساب. يرجى التواصل مع الدعم.

# email_already_in_use
source: An account already exists with this email address. Please login or use a different email.
ar: البريد الإلكتروني مستخدم بالفعل. يرجى تسجيل الدخول أو استخدام بريد آخر.

# wrong_password
source: The password you entered is incorrect. Please try again.
ar: كلمة المرور غير صحيحة. يرجى المحاولة مجددًا.

# too_many_requests
source: Too many requests. Please wait for a while before trying again.
ar: طلبات كثيرة جدًا. يرجى الانتظار قليلًا قبل المحاولة مرة أخرى.

# account_exists_with_different_credentials
source: An account with this email exists but with different credentials. Try logging in with a different method.
ar: حساب مرتبط بهذا البريد موجود بالفعل ولكن باستخدام طريقة مختلفة. حاول تسجيل الدخول بطريقة أخرى.

# requires_recent_login
source: For security purposes, please log in again to continue.
ar: يرجى تسجيل الدخول مجددًا لأسباب أمنية.

# provider_already_linked
source: This account is already linked to another authentication provider.
ar: هذا الحساب مرتبط بمزود آخر.

# no_such_provider
source: The provider you are trying to use is not available for this account.
ar: المزود الذي تحاول استخدامه غير متاح.

# invalid_user_token
source: The user token is invalid. Please log in again.
ar: رمز المستخدم غير صالح. يرجى تسجيل الدخول مرة أخرى.

# user_token_expired
source: The session has expired. Please log in again.
ar: انتهت صلاحية الجلسة. يرجى تسجيل الدخول مجددًا.

# user_not_found
source: No user was found with this information. Please check your details.
ar: لم يتم العثور على المستخدم. تحقق من المعلومات.

# invalid_api_key
source: The API key used is invalid. Contact support if the issue persists.
ar: مفتاح API غير صالح. تواصل مع الدعم إذا استمرت المشكلة.

# credential_already_in_use
source: This credential is already in use with another account. Try a different login method.
ar: تم استخدام هذه البيانات في حساب آخر. حاول بطريقة مختلفة.

# operation_not_allowed
source: This operation is not allowed. Contact the administrator for more information.
ar: هذه العملية غير مسموح بها. تواصل مع المسؤول للحصول على المزيد من المعلومات.

# weak_password
source: The password entered is too weak. Use a stronger password with more characters.
ar: كلمة المرور ضعيفة. يرجى استخدام كلمة مرور أقوى.

# app_not_authorized
source: This app is not authorized to access the Firebase project. Contact the administrator.
ar: هذا التطبيق غير مصرح له. تواصل مع المسؤول.

# expired_action_code
source: This action code has expired. Request a new one to proceed.
ar: رمز التفعيل انتهت صلاحيته. يرجى طلب رمز جديد.

# invalid_action_code
source: The action code provided is invalid or has already been used.
ar: رمز التفعيل غير صالح أو تم استخدامه بالفعل.

# invalid_message_payload
source: The message payload is invalid. Please contact support.
ar: الرسالة غير صحيحة. تواصل مع الدعم.

# invalid_sender
source: The sender is not authorized. Please ensure you are using a valid email.
ar: المرسل غير صالح. يرجى استخدام بريد إلكتروني صحيح.

# invalid_recipient_email
source: The recipient email address is invalid. Please check and try again.
ar: البريد الإلكتروني المستلم غير صالح. تحقق من البريد.

# unauthorized_domain
source: The domain you are trying to use is not authorized. Contact support for further details.
ar: النطاق غير مصرح له. تواصل مع الدعم.

# invalid_continue_uri
source: The continue URL provided is invalid.
ar: رابط المتابعة غير صالح.

# missing_continue_uri
source: A continue URL is required but missing. Please provide one.
ar: رابط المتابعة مفقود. يرجى تقديمه.

# missing_email
source: The email field is required. Please provide an email address.
ar: البريد الإلكتروني مفقود. يرجى إدخال البريد الإلكتروني.

# missing_phone_number
source: The phone number field is required. Please provide a phone number.
ar: رقم الهاتف مفقود. يرجى إدخال الرقم.

# invalid_phone_number
source: The phone number entered is invalid. Please provide a valid phone number.
ar: رقم الهاتف غير صالح. يرجى إدخال رقم صحيح.

# missing_verification_code
source: The verification code is missing. Please enter the code sent to you.
ar: رمز التحقق مفقود. يرجى إدخال الرمز المرسل.

# invalid_verification_code
source: The verification code entered is invalid. Please try again.
ar: رمز التحقق غير صحيح. يرجى المحاولة مجددًا.

# missing_verification_id
source: The verification ID is missing. Please try the process again.
ar: معرف التحقق مفقود. حاول مرة أخرى.

# invalid_verification_id
source: The verification ID entered is invalid. Please try again.
ar: معرف التحقق غير صالح. حاول مجددًا.

# session_expired
source: The session has expired. Please log in again.
ar: انتهت صلاحية الجلسة. يرجى تسجيل الدخول مجددًا.

# quota_exceeded
source: The quota for this operation has been exceeded. Try again later.
ar: تم تجاوز الحد الأقصى. حاول مرة أخرى لاحقًا.

# missing_app_credential
source: The app credential is missing. Please try again.
ar: بيانات الاعتماد الخاصة بالتطبيق مفقودة. حاول مجددًا.

# invalid_app_credential
source: The app credential entered is invalid.
ar: بيانات الاعتماد الخاصة بالتطبيق غير صحيحة.

# missing_client_identifier
source: The client identifier is missing.
ar: معرف العميل مفقود.

# tenant_id_mismatch
source: The tenant ID does not match the expected value.
ar: معرف المستأجر غير متطابق.

# unsupported_tenant_operation
source: This operation is not supported for this tenant.
ar: هذه العملية غير مدعومة لهذا المستأجر.

# user_mismatch
source: The logged-in user does not match the expected user.
ar: المستخدم الحالي لا يتطابق مع المستخدم المتوقع.

# network_request_failed
source: A network error occurred. Please check your connection and try again.
ar: حدث خطأ في الشبكة أثناء تسجيل الدخول. يرجى التحقق من اتصال الإنترنت والمحاولة مرة أخرى.

# no_signed_in_user
source: No user is signed in. Please log in to continue.
ar: لا يوجد مستخدم مسجل الدخول. يرجى تسجيل الدخول.

# cancelled
source: The operation was cancelled. Please try again.
ar: تم إلغاء العملية. حاول مجددًا.

# unknown_error
source: An unknown error occurred. Please try again later.
ar: حدث خطأ غير معروف. حاول مرة أخرى لاحقًا.

# invalid_argument
source: An invalid argument was provided. Please check your input.
ar: تم تقديم حجة غير صالحة. يرجى التحقق من إدخالك.

# deadline_exceeded
source: The operation took too long to complete. Please try again later.
ar: استغرقت العملية وقتاً طويلاً لإكمالها. يرجى المحاولة مرة أخرى لاحقاً.

# not_found
source: The requested resource was not found.
ar: المورد المطلوب غير موجود.

# already_exists
source: The resource already exists.
ar: المورد موجود بالفعل.

# permission_denied
source: You do not have permission to perform this action.
ar: ليس لديك إذن لإجراء هذا العمل.

# resource_exhausted
source: Resource limit exceeded. Please try again later.
ar: تم تجاوز الحد المسموح للموارد. يرجى المحاولة مرة أخرى لاحقاً.

# failed_precondition
source: The operation cannot be performed due to failed precondition.
ar: لا يمكن تنفيذ العملية بسبب شرط مسبق غير متحقق.

# aborted
source: The operation was aborted due to a conflict.
ar: تم إلغاء العملية بسبب تعارض.

# out_of_range
source: The provided value is out of the acceptable range.
ar: القيمة المقدمة خارج النطاق المقبول.

# unimplemented
source: This operation is not implemented or supported.
ar: لم يتم تنفيذ أو دعم هذه العملية.

# internal
source: An internal error occurred. Please try again later.
ar: حدث خطأ داخلي. يرجى المحاولة مرة أخرى لاحقاً.
