Repository: smart-fire-system/flutter-app
Catalog: lib/l10n/intl_*.arb
Languages: ar

# unavailable
source: The service is currently unavailable. Please check your connection or try again later.
ar: الخدمة غير متاحة حالياً. يرجى التحقق من الاتصال أو المحاولة لاحقاً.

# data_loss
source: Data loss occurred. Please try again later.
ar: حدث فقدان للبيانات. يرجى المحاولة مرة أخرى لاحقاً.

# unauthenticated
source: You need to sign in to perform this action.
ar: يجب تسجيل الدخول للقيام بهذا العمل.

# sign_in_failed
source: The sign-in attempt has failed. Please try again later or contact support if the issue persists.
ar: فشلت محاولة تسجيل الدخول. يرجى المحاولة مرة أخرى لاحقاً أو الاتصال بالدعم إذا استمرت المشكلة.

# network_error
source: A network error occurred during sign-in. Please check your internet connection and try again.
ar: تم حدوث خطأ في الشبكة أثناء تسجيل الدخول. يرجى التحقق من اتصال الإنترنت والمحاولة مرة أخرى.

# sign_in_cancelled
source: The sign-in process was cancelled. Please try again if you want to continue.
ar: تم إلغاء عملية تسجيل الدخول. يرجى المحاولة مرة أخرى إذا كنت ترغب في المتابعة.

# sign_in_required
source: You need to sign in to proceed. Please sign in and try again.
ar: يجب تسجيل الدخول للمتابعة. يرجى تسجيل الدخول والمحاولة مرة أخرى.

# contract_wait_employee_sign_subtitle
source: You must sign first to activate the contract.
ar: يجب أن تقوم بالتوقيع أولاً ليكون العقد ساري.

# contract_wait_other_client_sign_title
source: Waiting for client signature
ar: بانتظار توقيع العميل

# contract_wait_other_client_sign_subtitle
source: Waiting for the client signature to activate the contract.
ar: بانتظار توقيع العميل لكي يكون العقد ساري.

# contract_active_title
source: Contract Active
ar: العقد ساري

# contract_active_until
source: Active until {date}
ar: العقد ساري حتى {date}

# contract_expired_title
source: Contract Expired
ar: العقد منتهي

# contract_expired_since
source: Expired on {date}
ar: العقد منتهي منذ {date}

# snackbar_signing_not_enabled
source: Signing is not enabled yet
ar: التوقيع غير مفعّل بعد

# snackbar_client_notification_not_enabled
source: Client notification is not enabled yet
ar: تنبيه العميل غير مفعّل بعد

# signature_employee_title
source: Employee Signature
ar: توقيع الموظف

# signature_client_title
source: Client Signature
ar: توقيع العميل

# signature_confirm_dialog_title
source: Confirm {title}
ar: تأكيد {title}

# signature_confirm_dialog_body
source: By confirming, your signature will be recorded on this contract. This action cannot be undone.
ar: بتأكيدك سيتم تسجيل توقيعك على هذا العقد. لا يمكن التراجع عن هذه العملية.

source: Slide to confirm
ar: اسحب للتأكيد

# linear_stage_draft
source: Draft
ar: مسودة

# linear_stage_employee_signed
source: Employee Signed
ar: توقيع الموظف

# linear_stage_client_signed
source: Client Signed
ar: توقيع العميل

# linear_stage_active
source: Active
ar: ساري

# linear_stage_expired
source: Expired
ar: منتهي

# contract_number_prefix
source: Contract No: {number}
ar: عقد رقم: {number}

# contract_label
source: Contract
ar: عقد

# period_from
source: Active from
ar: ساري من

# period_to
source: to
ar: إلى

# employee_label
source: Employee:
ar: الموظف:

# client_label
source: Client:
ar: العميل:

# branch_label
source: Branch:
ar: الفرع:

# sign_employee_required_title
source: Employee signature required
ar: توقيع الموظف مطلوب أولاً

# sign_employee_required_subtitle
source: You must sign first so the client can sign.
ar: يجب أن تقوم بالتوقيع أولاً ليتمكّن العميل من التوقيع.

# waiting_employee_signature_title
source: Waiting for employee signature
ar: بانتظار توقيع الموظف

# waiting_employee_signature_subtitle
source: Waiting for the employee signature so the client can sign.
ar: بانتظار توقيع الموظف لكي يتمكن العميل من التوقيع.

# sign_client_required_title
source: Client signature required
ar: توقيع العميل مطلوب أولاً

source: View Contract
ar: عرض العقد

# view_contract_subtitle
source: View contract details and export to PDF
ar: عرض تفاصيل العقد والتحويل إلى PDF

# new_visit_report
source: Add Visit Report
ar: إضافة تقرير زيارة

# new_visit_report_subtitle
source: Add new visit report
ar: إضافة تقرير زيارة جديد

source: Visit Reports
ar: تقارير الزيارة

# visit_reports_subtitle
source: View visit details and export to PDF
ar: عرض تفاصيل الزيارات والتحويل إلى PDF

# emergency_visit_request
source: Request Emergency Visit
ar: طلب زيارة طوارئ

# emergency_visit_request_subtitle
source: Request emergency visit
ar: طلب زيارة طوارئ

source: Contracts
ar: العقود

# no_contracts_yet
source: There are no contracts yet!
ar: لا توجد عقود مضافة بعد!

# reports_contracts_title
source: Reports & Contracts
ar: التقارير والعقود

# reports_contracts_card_title
source: Contracts & Reports
ar: العقود والتقارير

# reports_contracts_card_subtitle
source: View and manage contracts and visit reports, submit emergency requests or complaints.
ar: عرض وإدارة العقود وتقارير الزيارات، وتقديم طلبات طوارئ أو شكاوى.

# reports_contracts_subtitle
source: View and manage reports & contracts
ar: عرض وإدارة التقارير والعقود

source: Contract Components
ar: مكونات العقد

# contract_components_subtitle
source: Update contract components
ar: تحديث مكونات العقود

# new_contract
source: Add Contract
ar: إضافة عقد

# new_new_contract_subtitle
source: Add new contract
ar: إضافة عقد جديد

source: Offline Mode
ar: وضع عدم الاتصال

# offline_mode_subtitle
source: View and manage system in offline mode
ar: عرض وإدارة النظام في وضع عدم الاتصال

source: Share Contract
ar: مشاركة العقد

# share_contract_subtitle
source: Share contract with other employees or clients
ar: مشاركة العقد مع موظفين أو عملاء آخرين

source: Share with
ar: المشاركة مع

source: No users
ar: لا يوجد مستخدمون

# contract_sharing_updated_success
source: Contract sharing updated successfully.
ar: تم تحديث مشاركة العقد بنجاح.

# contract_signed_success
source: Contract signed successfully.
ar: تم توقيع العقد بنجاح.

source: Emergency Visits
ar: زيارات الطوارئ

# emergency_visits_subtitle
source: View emergency visits or request a new one
ar: عرض زيارات الطوارئ أو طلب زيارة جديدة

source: Feature not supported yet
ar: الميزة غير مدعومة بعد

source: Suitable
ar: ملائم

source: Unsuitable
ar: غير ملائم

# system_report_no
source: System Report No. {number}
ar: تقرير زيارة رقم: {number}

source: Visit Date:
ar: تاريخ الزيارة:

source: System Status:
ar: حالة النظام:

source: Signed
ar: موقًع

source: Not Signed
ar: غير موقًع

# visit_report_signed_success
source: Visit report signed successfully.
ar: تم توقيع تقرير الزيارة بنجاح.

# notifications_subtitle
source: View notifications
ar: عرض الاشعارات

source: View Visit Report
ar: عرض تقرير الزيارة

# signature_confirm_dialog_body_visit_report
source: By confirming, your signature will be recorded on this visit report. This action cannot be undone.
ar: بتأكيدك سيتم تسجيل توقيعك على تقرير الزيارة هذا. لا يمكن التراجع عن هذه العملية.

# visit_report_wait_client_sign_subtitle
source: Please sign the visit report to proceed.
ar: يرجى توقيع تقرير الزيارة للمتابعة.

# visit_report_wait_other_client_sign_subtitle
source: Waiting for the client signature to complete the visit report.
ar: بانتظار توقيع العميل لإكمال تقرير الزيارة.

source: First Party Information
ar: بيانات الطرف الأول

source: First Party Name
ar: اسم الطرف الأول

source: First Party Representative Name
ar: اسم ممثل الطرف الأول

source: First Party Address
ar: عنوان الطرف الأول

source: First Party Commercial Record
ar: السجل التجاري للطرف الأول

source: First Party G
ar: الرقم الضريبي للطرف الأول

source: First Party ID Number
ar: رقم هوية الطرف الأول

source: First Party Signature
ar: توقيع الطرف الأول

source: Tap to upload signature
ar: اضغط لرفع التوقيع

source: Actions
ar: إجراءات

source: Representative Name
ar: اسم الممثل

source: Commercial Record
ar: السجل التجاري

source: G
ar: الرقم الضريبي

source: ID Number
ar: رقم الهوية

source: Signature
ar: التوقيع

source: No signature added yet
ar: لا يوجد توقيع مضاف بعد
